; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem blocksworld-99)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 - object)
 (:init 
    (arm-empty)
    (clear b14)
    (on b14 b10)
    (on b10 b25)
    (on b25 b1)
    (on b1 b13)
    (on-table b13)
    (clear b27)
    (on b27 b7)
    (on b7 b4)
    (on b4 b18)
    (on b18 b3)
    (on b3 b9)
    (on b9 b17)
    (on b17 b11)
    (on b11 b12)
    (on b12 b28)
    (on-table b28)
    (clear b26)
    (on b26 b5)
    (on b5 b22)
    (on b22 b24)
    (on-table b24)
    (clear b23)
    (on b23 b16)
    (on b16 b6)
    (on b6 b21)
    (on b21 b8)
    (on b8 b15)
    (on-table b15)
    (clear b20)
    (on b20 b29)
    (on b29 b2)
    (on b2 b19)
    (on-table b19))
 (:goal (and 
(on b23 b4)
))
)

; plan
1. (unstack b27 b7)
   deleted: (on b27 b7) (clear b27) (arm-empty)
   added: (holding b27) (clear b7)
   goals met: 0 of 1
2. (putdown b27)
   deleted: (holding b27)
   added: (clear b27) (arm-empty) (on-table b27)
   goals met: 0 of 1
3. (unstack b7 b4)
   deleted: (on b7 b4) (clear b7) (arm-empty)
   added: (holding b7) (clear b4)
   goals met: 0 of 1
4. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 0 of 1
5. (unstack b23 b16)
   deleted: (on b23 b16) (clear b23) (arm-empty)
   added: (holding b23) (clear b16)
   goals met: 0 of 1
6. (stack b23 b4)
   deleted: (clear b4) (holding b23)
   added: (arm-empty) (clear b23) (on b23 b4)
   goals met: 1 of 1
